Tekla Open API Reference for Tekla Structures 2025
RebarSpacing.Create Method (RebarSpacing.Offset, RebarSpacing.Offset, IEnumerable<RebarSpacing.ExactSpacing.Element>, RebarSpacing.ExactSpacing.Validation)
 Creates an exact spacing if the given elements are valid.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static RebarSpacing Create(
	RebarSpacing.Offset startOffset,
	RebarSpacing.Offset endOffset,
	IEnumerable<RebarSpacing.ExactSpacing.Element> elements,
	out RebarSpacing.ExactSpacing.Validation validation
)
Public Shared Function Create (
	startOffset As RebarSpacing.Offset,
	endOffset As RebarSpacing.Offset,
	elements As IEnumerable(Of RebarSpacing.ExactSpacing.Element),
	<OutAttribute> ByRef validation As RebarSpacing.ExactSpacing.Validation
) As RebarSpacing
Parameters
startOffset
Type: Tekla.Structures.Model.RebarSpacing.Offset
The start offset.
endOffset
Type: Tekla.Structures.Model.RebarSpacing.Offset
The end offset.
elements
Type: System.Collections.Generic.IEnumerable<RebarSpacing.ExactSpacing.Element>
The elements.
validation
Type: Tekla.Structures.Model.RebarSpacing.ExactSpacing.Validation
Returns a value indicating the validity of the elements.
Return Value
Type: RebarSpacing
A RebarSpacing instance.
See Also
Reference
RebarSpacing Class
Create Overload
Tekla.Structures.Model Namespace